import re

"""

A regular expression is a sequence of characters that specifies a search pattern in text. 
Usually such patterns are used by string-searching algorithms for “find” or “find and replace” 
operations on strings, or for input validation.

------------------------------------------------------------------------------------------------------------------------

Регулярное выражение — это последовательность символов, задающая шаблон поиска в тексте. 
Обычно такие шаблоны используются алгоритмами поиска строк для операций «найти» или 
«найти и заменить» над строками или для проверки ввода.

"""
text = "AC/DCAC/DCAC/DCAC/DCAC/DC"

#########################################################################################################################
# match_result = re.match("AC", text) # match ищет в начале строки
# print(match_result) # <re.Match object; span=(0, 2), match='AC'>
#########################################################################################################################
# search_result = re.search("DC", text) # search ищет по всей строке и возвращает первый найденный элемент
# print(search_result) # <re.Match object; span=(3, 5), match='DC'>
#########################################################################################################################
# all_result = re.findall("DC", text) # findall ищет по всей строке и возвращает все элементы
# print(all_result) # ['DC', 'DC', 'DC', 'DC', 'DC']
#########################################################################################################################
# split_result = re.split("DC", text) # split разделяет строку по заданному выражению
# print(split_result) # ['AC/', 'AC/', 'AC/', 'AC/', 'AC/', '']
#########################################################################################################################
# sub_result = re.sub("DC", "dc", text) # sub работает как replace() в строках
# print(sub_result) # AC/dcAC/dcAC/dcAC/dcAC/dc
#########################################################################################################################
# fullmatch_result = re.fullmatch("DC", text) # fullmatch проверяет на полное совпадение строк
# print(fullmatch_result) # None
#########################################################################################################################